Rechnerubung/Week2/Aufgabe2/RANS/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../config"
oneByReTau      #calc "1.0/$reTau";

momentumSource
{
    type      vectorSemiImplicitSource;

    selectionMode   all;

    volumeMode      specific;
    injectionRateSuSp
    {
        U    (($oneByReTau 0 0) 0);
    } 
}


// ************************************************************************* //
